In [1]:
import pandas as pd
import numpy as np

In [15]:
dfs = pd.read_csv(r'C:\Users\Jagatheesh\OneDrive\Desktop\Heriot_Watt_University_Msc_Data_Science\Data_Viz_CW2\Cost_of_living_crisis_UK_Storyboard\Resources\DataSet\HousePriceIndex.csv')
pd.options.display.float_format = '{:.2f}'.format

In [16]:
dfs['year']=dfs['Date'].apply(lambda x:x[-4:])
dfs1=dfs[dfs['year'].isin(['2004','2005','2006','2007','2008'])]
dfs2=dfs[dfs['year'].isin(['2020','2021','2022'])]
# final=dfs[['RegionName','AveragePrice']].groupby('RegionName').mean().sort_values(by='AveragePrice',ascending=False)

In [4]:
final['RegionName']=final.index
final.index=[x for x in range(0,len(final))]

In [5]:
for i in final['RegionName'].unique():
    if 'midlands' in str.lower(i):
        print(i)

West Midlands Region
East Midlands
West Midlands

In [6]:
regions=['Wales',
'Scotland',
'Northern Ireland',
'South West',
'South East',
'London',
'East',
'West Midlands',
'East Midlands',
'Yorkshire and the Humber',
'North West',
'North East']

In [7]:
map_data=final[final['RegionName'].isin(regions)].reset_index(drop=True)
map_data

   AveragePrice        RegionName
0     494927.39            London
1     342554.25        South East
2     278018.08        South West
3     210887.47     East Midlands
4     198480.45     West Midlands
5     181632.58        North West
6     181475.89             Wales
7     165224.37          Scotland
8     149687.74  Northern Ireland
9     138452.78        North East

In [8]:
map_data.rename(columns={'AveragePrice':'MedianPrice'},inplace=True)
map_data.to_csv('housepriceregion.csv')

In [17]:
times_early=dfs1.copy()
times_early=times_early[times_early['RegionName'].isin(regions)]
times_late=dfs2.copy()
times_late=times_late[times_late['RegionName'].isin(regions)]

In [23]:
times_late=times_late[['Date','AveragePrice']]

In [24]:
times_early=times_early[['Date','AveragePrice']]

In [26]:
times_early['Date'] = pd.to_datetime(times_early['Date'])
times_late['Date']=pd.to_datetime(times_late['Date'])

C:\Users\Jagatheesh\AppData\Local\Temp\ipykernel_29500\2721325884.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  times_early['Date'] = pd.to_datetime(times_early['Date'])
C:\Users\Jagatheesh\AppData\Local\Temp\ipykernel_29500\2721325884.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  times_late['Date']=pd.to_datetime(times_late['Date'])

In [31]:
mytime=pd.concat([times_early,times_late])
mytime.sort_values(by='Date',inplace=True)
mytime

             Date  AveragePrice
36763  2004-01-01     119410.69
77066  2004-01-01      90993.71
80858  2004-01-01      95631.70
82154  2004-01-01      96619.58
95476  2004-01-01      79664.53
...           ...           ...
121823 2022-01-01     206251.08
95692  2022-01-01     182785.72
100601 2022-01-01     378311.47
66341  2022-01-01     510102.40
127132 2022-01-01     215090.83

[850 rows x 2 columns]

In [36]:
mytime['Year'] = mytime['Date'].dt.year
mytime

             Date  AveragePrice  Year
36763  2004-01-01     119410.69  2004
77066  2004-01-01      90993.71  2004
80858  2004-01-01      95631.70  2004
82154  2004-01-01      96619.58  2004
95476  2004-01-01      79664.53  2004
...           ...           ...   ...
121823 2022-01-01     206251.08  2022
95692  2022-01-01     182785.72  2022
100601 2022-01-01     378311.47  2022
66341  2022-01-01     510102.40  2022
127132 2022-01-01     215090.83  2022

[850 rows x 3 columns]

In [37]:
mytime=mytime[['Year','AveragePrice']]
mytime=mytime.groupby('Year').mean()
mytime

      AveragePrice
Year
2004     136467.08
2005     148352.87
2006     161408.48
2007     181036.24
2008     171490.21
2020     223422.42
2021     243146.62
2022     254524.03